Моя/src/Documents/Счет/Счет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Счет</name>
  <registerRecords>AccumulationRegister.Доходы</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договора</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>флагОплатаПоКурсу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧасоваяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокументаВалюта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>флагВыводитьПодпись</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЭквивалент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.СтатусыСчета</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Часов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРаботы</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеУчитыватьВДодохе</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Моя/src/AccumulationRegisters/Доходы/Доходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Доходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаДохода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаЭквивалент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Моя/src/Documents/Счет/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	НоменклатураТолькоМойДоход = Номенклатура.Выгрузить(Новый Структура("НеУчитыватьВДодохе", Ложь));
	СуммаДокумента = НоменклатураТолькоМойДоход.Итог("Сумма");
	
	КурсКонверсии = ОбщегоНазначения.КроссКурс(Валюта, Справочники.Валюты.USD, Дата);
	
	СуммаЭквивалент = СуммаДокумента / КурсКонверсии;
	
	Если ЭтоНовый() Тогда
		Номер = ПолучитьНовыйНомер();
	КонецЕсли;		
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	ДвиженияПоРегиструДоходов();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДвиженияПоРегиструДоходов()
	КурсКонверсии = ОбщегоНазначения.КроссКурс(Валюта, Справочники.Валюты.USD, Дата);
	
	Таблица = Номенклатура.Выгрузить(Новый Структура("НеУчитыватьВДодохе", Ложь));
	СуммаДохода = Таблица.Итог("Сумма");
	СуммаДоходаЭквивалент = СуммаДохода / КурсКонверсии;
	
	// регистр Доходы 
	Движения.Доходы.Записывать = Истина;
	Движение					= Движения.Доходы.Добавить();
	Движение.Валюта				= Валюта;
	Движение.Период				= Дата;
	Движение.Контрагент			= Контрагент;
	Движение.СуммаДохода		= СуммаДохода;
	Движение.СуммаЭквивалент	= СуммаДоходаЭквивалент;
КонецПроцедуры

Функция ПолучитьНовыйНомер() Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("НачалоПериод", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(Счет.Ссылка) КАК КоличествоДокументов
	|ИЗ
	|	Документ.Счет КАК Счет
	|ГДЕ
	|	Счет.Дата МЕЖДУ &НачалоПериод И &КонецПериода
	|	И НЕ Счет.ПометкаУдаления
	|	И Счет.Ссылка <> &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат СтрШаблон("%1/%2", Месяц(Дата), Формат(Выборка.КоличествоДокументов + 1, "ЧЦ=2; ЧВН=; ЧГ=0"));
	Иначе
		Возврат СтрШаблон("%1/%2", Месяц(Дата), "01");	
	КонецЕсли;	
КонецФункции	

#КонецОбласти

#КонецЕсли
